## Dataframes Method from Pandas

Exploring Data Frames Methods

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('car-sales.csv')

In [3]:
## getting first n dataframes
firstNdata = df.head(3)
print(firstNdata)

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00

In [4]:
## Getting last n-dataframes
lastNData = df.tail(5)
print(lastNData)

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [5]:
## Getting the dimension of the data frame

dimension = df.shape
print(dimension)

(10, 5)

In [6]:
## Accessing individual elements of shape

rows = dimension[0]
columns = dimension[1]
print(f"Number of rows: {rows}")
print(f"Number of columns: {columns}")

Number of rows: 10
Number of columns: 5

## Accessing and modifying dataframes data

In [7]:
## Accesing single row by label

first_row = df.loc[0]
print(f"First Row data: {first_row}")

First Row data: Make                Toyota
Colour               White
Odometer (KM)       150043
Doors                    4
Price            $4,000.00
Name: 0, dtype: object

In [8]:
## # Access multiple rows by label

multiple_rows = df.loc[[0, 1, 2]]
print(multiple_rows)

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00

In [9]:
## Access a single element by label
single_row_element = df.loc[0, 'Make']
print(single_row_element)

Toyota

In [10]:
## Access multiple columns by label

multiple_columns_data = df.loc[:, ["Make", "Price"]]
print(multiple_columns_data)

     Make       Price
0  Toyota   $4,000.00
1   Honda   $5,000.00
2  Toyota   $7,000.00
3     BMW  $22,000.00
4  Nissan   $3,500.00
5  Toyota   $4,500.00
6   Honda   $7,500.00
7   Honda   $7,000.00
8  Toyota   $6,250.00
9  Nissan   $9,700.00